BoxDomain/Eindhoven_51.44844_5.46475_dir100/100/0.org/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       IOobject;
    location    "0";
    object ABLConditions;
        }

        // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
        Uref		5;
        Zref		10;
        z0 uniform 1;
        flowDir (-0.984807753012208 0.17364817766693 0);
        zDir (0 0 1);
        zGround uniform 0;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
