BoxDomain/Eindhoven_51.44844_5.46475_dir100/100/0.org/aoa
/*--------------------------------*- C++ -*----------------------------------*\
 | =========                 |                                                 |
 | \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
 |  \\    /   O peration     | Version:  2.2.2                                 |
 |   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
 |    \\/     M anipulation  |                                                 |
 \*---------------------------------------------------------------------------*/
    FoamFile
{
    version     2.0;
    format ascii;
    class volScalarField;
    location    "0";
    object aoa;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 0 0 1 0 0 0];

internalField   uniform 0;

boundaryField
{
   frontAndBack
    {
        type zeroGradient;
    }
    ground
    {
         type zeroGradient;
    }
ground_perim
    {
          type zeroGradient;
    }
building
    {
           type zeroGradient;
    }
	inlet
    {
          type            fixedValue;
        value           uniform 0;
    }
    outlet
    {
     type zeroGradient;
    }
}

